Repository: ttscoff/wp-svg-viewer
Catalog: wp-svg-viewer/languages/svg-viewer-*.po
Languages: de_de

source: Error: SVG preset not found for ID %s.
de_de: Fehler: SVG-Voreinstellung wurde für die ID %s nicht gefunden.

source: Error: SVG source not specified. Use [svg_viewer src="path/to/file.svg"]
de_de: Fehler: SVG-Quelle nicht angegeben. Verwenden Sie [svg_viewer src="path/to/file.svg"]

source: Error: Invalid SVG path.
de_de: Fehler: Ungültiger SVG-Pfad.

source: SVG Viewer Presets
de_de: SVG-Viewer-Voreinstellungen

source: SVG Viewer Preset
de_de: SVG-Viewer-Voreinstellung

source: Add New Preset
de_de: Neue Voreinstellung hinzufügen

source: Add New SVG Viewer Preset
de_de: Neue SVG-Viewer-Voreinstellung hinzufügen

source: Edit SVG Viewer Preset
de_de: SVG-Viewer-Voreinstellung bearbeiten

source: New SVG Viewer Preset
de_de: Neue SVG-Viewer-Voreinstellung

source: View SVG Viewer Preset
de_de: SVG-Viewer-Voreinstellung anzeigen

source: Search SVG Viewer Presets
de_de: SVG-Viewer-Voreinstellungen durchsuchen

source: No presets found
de_de: Keine Voreinstellungen gefunden

source: No presets found in trash
de_de: Keine Voreinstellungen im Papierkorb gefunden

source: Please select an SVG before loading the preview.
de_de: Bitte wählen Sie ein SVG aus, bevor Sie die Vorschau laden.

source: Captured viewer state from the preview.
de_de: Viewer-Status aus der Vorschau übernommen.

source: Unable to capture the current state. Refresh the preview and try again.
de_de: Aktueller Status kann nicht erfasst werden. Aktualisieren Sie die Vorschau und versuchen Sie es erneut.

source: Shortcode copied to clipboard.
de_de: Shortcode in die Zwischenablage kopiert.

source: Press ⌘/Ctrl+C to copy the shortcode.
de_de: Drücken Sie ⌘/Strg+C, um den Shortcode zu kopieren.

source: SVG Viewer Settings
de_de: SVG-Viewer-Einstellungen

source: Settings
de_de: Einstellungen

source: Help
de_de: Hilfe

source: Preset Shortcode
de_de: Shortcode der Voreinstellung

source: Copy
de_de: Kopieren

source: Use this shortcode in pages or posts to embed this preset.
de_de: Verwenden Sie diesen Shortcode in Seiten oder Beiträgen, um diese Voreinstellung einzubetten.

source: SVG Source URL
de_de: SVG-Quell-URL

source: https://example.com/my-graphic.svg or uploads/2025/graphic.svg
de_de: https://example.com/my-graphic.svg oder uploads/2025/graphic.svg

source: Select SVG
de_de: SVG auswählen

source: Viewer Height
de_de: Viewer-Höhe

source: Min Zoom (%)
de_de: Minimaler Zoom (%)

source: Max Zoom (%)
de_de: Maximaler Zoom (%)

source: Initial Zoom (%)
de_de: Initialer Zoom (%)

source: Zoom Increment (%)
de_de: Zoomschritt (%)

source: Center X
de_de: Zentrum X

source: Center Y
de_de: Zentrum Y

source: Controls Position
de_de: Position der Bedienelemente

source: Top
de_de: Oben

source: Bottom
de_de: Unten

source: Left
de_de: Links

source: Right
de_de: Rechts

source: Controls Buttons/Layout
de_de: Schaltflächen/Layout der Bedienelemente

source: Combine multiple options with commas. Examples: both, icon, text, compact, labels-on-hover, minimal, alignleft, aligncenter, alignright, custom,both,aligncenter,zoom_in,zoom_out,reset,center,coords
de_de: Kombinieren Sie mehrere Optionen mit Kommas. Beispiele: both, icon, text, compact, labels-on-hover, minimal, alignleft, aligncenter, alignright, custom,both,aligncenter,zoom_in,zoom_out,reset,center,coords

source: Title (optional)
de_de: Titel (optional)

source: Caption (optional)
de_de: Beschriftung (optional)

source: Supports basic HTML formatting.
de_de: Unterstützt grundlegende HTML-Formatierung.

source: Load / Refresh Preview
de_de: Vorschau laden/aktualisieren

source: Use Current View for Initial State
de_de: Aktuelle Ansicht als Ausgangszustand verwenden

source: Help content is not available. Run the "Render Help" build step to regenerate it.
de_de: Hilfsinhalt ist nicht verfügbar. Führen Sie den Build-Schritt „Render Help“ aus, um ihn neu zu erzeugen.

source: Zoom In
de_de: Vergrößern

source: Zoom In (Ctrl +)
de_de: Vergrößern (Strg +)

source: Zoom Out
de_de: Verkleinern

source: Zoom Out (Ctrl -)
de_de: Verkleinern (Strg -)

source: Reset Zoom
de_de: Zoom zurücksetzen

source: Center View
de_de: Ansicht zentrieren

source: Copy Center
de_de: Zentrum kopieren

source: Copy current center coordinates
de_de: Aktuelle Mittelpunktkoordinaten kopieren
