Repository: ttscoff/wp-svg-viewer
Catalog: bt-svg-viewer/languages/bt-svg-viewer-*.po
Languages: es_es, fr_fr, it_it

source: Full shortcode copied to clipboard.
es_es: Shortcode completo copiado al portapapeles.
fr_fr: Shortcode complet copié dans le presse-papiers.
it_it: Shortcode completo copiato negli appunti.

source: Copy full shortcode
es_es: Copiar shortcode completo
fr_fr: Copier le shortcode complet
it_it: Copia shortcode completo

source: Enable asset cache busting for debugging
es_es: Activar la ruptura de caché de recursos para depuración
fr_fr: Activer le cache-busting des ressources pour le débogage
it_it: Abilita il cache busting delle risorse per il debug

source: Adds a unique suffix to script and style versions so browsers always fetch the latest assets. Useful for local testing; disable for production.
es_es: Añade un sufijo único a las versiones de scripts y estilos para que los navegadores siempre obtengan los recursos más recientes. Útil para pruebas locales; desactívalo en producción.
fr_fr: Ajoute un suffixe unique aux versions des scripts et styles afin que les navigateurs récupèrent toujours les dernières ressources. Utile pour les tests locaux ; à désactiver en production.
it_it: Aggiunge un suffisso univoco alle versioni di script e stili affinché i browser scarichino sempre le risorse più recenti. Utile per i test locali; disabilitalo in produzione.

source: Cmd/Ctrl-click to zoom in, Option/Alt-click to zoom out.
es_es: Cmd/Ctrl-clic para acercar, Opción/Alt-clic para alejar.
fr_fr: Cliquer avec Cmd/Ctrl pour zoomer, cliquer avec Option/Alt pour dézoomer.
it_it: Cmd/Ctrl-clic per ingrandire, Option/Alt-clic per ridurre.

source: Scroll up to zoom in, scroll down to zoom out.
es_es: Desplaza hacia arriba para acercar, hacia abajo para alejar.
fr_fr: Faites défiler vers le haut pour zoomer, vers le bas pour dézoomer.
it_it: Scorri verso l’alto per ingrandire, verso il basso per ridurre.

source: Drag to pan around the image while scrolling zooms.
es_es: Arrastra para desplazarte por la imagen mientras el desplazamiento hace zoom.
fr_fr: Faites glisser pour vous déplacer dans l’image pendant que le défilement effectue un zoom.
it_it: Trascina per spostarti nell’immagine mentre lo scorrimento esegue lo zoom.

source: Drag to pan around the image.
es_es: Arrastra para desplazarte por la imagen.
fr_fr: Faites glisser pour vous déplacer dans l’image.
it_it: Trascina per spostarti nell’immagine.

source: Error: SVG preset not found for ID %s.
es_es: Error: no se encontró el ajuste preestablecido SVG para el ID %s.
fr_fr: Erreur : préréglage SVG introuvable pour l’ID %s.
it_it: Errore: preset SVG non trovato per l'ID %s.

source: Error: SVG source not specified. Use [svg_viewer src="path/to/file.svg"]
es_es: Error: no se especificó la fuente SVG. Usa [svg_viewer src="path/to/file.svg"]
it_it: Errore: origine SVG non specificata. Usa [svg_viewer src="path/to/file.svg"]

source: Error: Invalid SVG path.
es_es: Error: ruta SVG no válida.
fr_fr: Erreur : chemin SVG non valide.
it_it: Errore: percorso SVG non valido.

source: BT SVG Viewer Presets
es_es: Ajustes preestablecidos de BT SVG Viewer
fr_fr: Préréglages BT SVG Viewer
it_it: Preset di BT SVG Viewer

source: BT SVG Viewer Preset
es_es: Ajuste preestablecido de BT SVG Viewer
fr_fr: Préréglage BT SVG Viewer
it_it: Preset BT SVG Viewer

source: Add New Preset
es_es: Añadir nuevo ajuste
fr_fr: Ajouter un préréglage
it_it: Aggiungi nuovo preset

source: Add New BT SVG Viewer Preset
es_es: Añadir nuevo ajuste preestablecido de BT SVG Viewer
fr_fr: Ajouter un préréglage BT SVG Viewer
it_it: Aggiungi nuovo preset di BT SVG Viewer

source: Edit BT SVG Viewer Preset
es_es: Editar ajuste preestablecido de BT SVG Viewer
fr_fr: Modifier le préréglage BT SVG Viewer
it_it: Modifica preset di BT SVG Viewer

source: New BT SVG Viewer Preset
es_es: Nuevo ajuste preestablecido de BT SVG Viewer
fr_fr: Nouveau préréglage BT SVG Viewer
it_it: Nuovo preset di BT SVG Viewer

source: View BT SVG Viewer Preset
es_es: Ver ajuste preestablecido de BT SVG Viewer
fr_fr: Voir le préréglage BT SVG Viewer
it_it: Visualizza preset di BT SVG Viewer

source: Search BT SVG Viewer Presets
es_es: Buscar ajustes preestablecidos de BT SVG Viewer
fr_fr: Rechercher des préréglages BT SVG Viewer
it_it: Cerca preset di BT SVG Viewer

source: No presets found
es_es: No se encontraron ajustes
fr_fr: Aucun préréglage trouvé
it_it: Nessun preset trovato

source: No presets found in trash
es_es: No se encontraron ajustes en la papelera
fr_fr: Aucun préréglage trouvé dans la corbeille
it_it: Nessun preset trovato nel cestino

source: Please select an SVG before loading the preview.
es_es: Selecciona un SVG antes de cargar la vista previa.
fr_fr: Veuillez sélectionner un SVG avant de charger l’aperçu.
it_it: Seleziona un SVG prima di caricare l'anteprima.

source: Captured viewer state from the preview.
es_es: Estado del visor capturado desde la vista previa.
fr_fr: État du viewer capturé depuis l’aperçu.
it_it: Stato del viewer acquisito dall'anteprima.

source: Unable to capture the current state. Refresh the preview and try again.
es_es: No se puede capturar el estado actual. Actualiza la vista previa e inténtalo de nuevo.
fr_fr: Impossible de capturer l’état actuel. Actualisez l’aperçu puis réessayez.
it_it: Impossibile acquisire lo stato attuale. Aggiorna l'anteprima e riprova.

source: Shortcode copied to clipboard.
es_es: Shortcode copiado al portapapeles.
fr_fr: Shortcode copié dans le presse-papiers.
it_it: Shortcode copiato negli appunti.

source: Press ⌘/Ctrl+C to copy the shortcode.
es_es: Pulsa ⌘/Ctrl+C para copiar el shortcode.
fr_fr: Appuyez sur ⌘/Ctrl+C pour copier le shortcode.
it_it: Premi ⌘/Ctrl+C per copiare lo shortcode.

source: BT SVG Viewer Settings
es_es: Ajustes de BT SVG Viewer
fr_fr: Paramètres de BT SVG Viewer
it_it: Impostazioni di BT SVG Viewer

source: Settings
es_es: Ajustes
fr_fr: Paramètres
it_it: Impostazioni

source: Help
es_es: Ayuda
fr_fr: Aide
it_it: Guida

source: Preset Shortcode
es_es: Shortcode del ajuste
fr_fr: Shortcode du préréglage
it_it: Shortcode del preset

source: Copy
es_es: Copiar
fr_fr: Copier
it_it: Copia

source: Use this shortcode in pages or posts to embed this preset.
es_es: Usa este shortcode en páginas o entradas para incrustar este ajuste.
fr_fr: Utilisez ce shortcode dans des pages ou des articles pour intégrer ce préréglage.
it_it: Usa questo shortcode nelle pagine o negli articoli per incorporare questo preset.

source: SVG Source URL
es_es: URL de origen del SVG
fr_fr: URL source du SVG
it_it: URL sorgente SVG

source: https://example.com/my-graphic.svg or uploads/2025/graphic.svg
es_es: https://example.com/my-graphic.svg o uploads/2025/graphic.svg
fr_fr: https://example.com/my-graphic.svg ou uploads/2025/graphic.svg
it_it: https://example.com/my-graphic.svg oppure uploads/2025/graphic.svg

source: Select SVG
es_es: Seleccionar SVG
fr_fr: Sélectionner un SVG
it_it: Seleziona SVG

source: Viewer Height
es_es: Altura del visor
fr_fr: Hauteur du viewer
it_it: Altezza viewer

source: Min Zoom (%)
es_es: Zoom mínimo (%)
fr_fr: Zoom minimum (%)
it_it: Zoom minimo (%)

source: Max Zoom (%)
es_es: Zoom máximo (%)
fr_fr: Zoom maximum (%)
it_it: Zoom massimo (%)

source: Initial Zoom (%)
es_es: Zoom inicial (%)
fr_fr: Zoom initial (%)
it_it: Zoom iniziale (%)

source: Zoom Increment (%)
es_es: Incremento de zoom (%)
fr_fr: Incrément de zoom (%)
it_it: Incremento zoom (%)

source: Center X
es_es: Centro X
fr_fr: Centre X
it_it: Centro X

source: Center Y
es_es: Centro Y
fr_fr: Centre Y
it_it: Centro Y

source: Controls Position
es_es: Posición de los controles
fr_fr: Position des contrôles
it_it: Posizione dei controlli

source: Top
es_es: Arriba
fr_fr: Haut
it_it: Alto

source: Bottom
es_es: Abajo
fr_fr: Bas
it_it: Basso

source: Left
es_es: Izquierda
fr_fr: Gauche
it_it: Sinistra

source: Right
es_es: Derecha
fr_fr: Droite
it_it: Destra

source: Controls Buttons/Layout
es_es: Botones/disposición de los controles
fr_fr: Boutons/Disposition des contrôles
it_it: Pulsanti/Layout dei controlli

source: Combine multiple options with commas. Examples: both, icon, text, compact, labels-on-hover, minimal, alignleft, aligncenter, alignright, custom,both,aligncenter,zoom_in,zoom_out,reset,center,coords
es_es: Combina varias opciones separadas por comas. Ejemplos: both, icon, text, compact, labels-on-hover, minimal, alignleft, aligncenter, alignright, custom,both,aligncenter,zoom_in,zoom_out,reset,center,coords
fr_fr: Combinez plusieurs options séparées par des virgules. Exemples : both, icon, text, compact, labels-on-hover, minimal, alignleft, aligncenter, alignright, custom,both,aligncenter,zoom_in,zoom_out,reset,center,coords
it_it: Combina più opzioni separate da virgole. Esempi: both, icon, text, compact, labels-on-hover, minimal, alignleft, aligncenter, alignright, custom,both,aligncenter,zoom_in,zoom_out,reset,center,coords

source: Title (optional)
es_es: Título (opcional)
fr_fr: Titre (optionnel)
it_it: Titolo (facoltativo)

source: Caption (optional)
es_es: Leyenda (opcional)
fr_fr: Légende (optionnelle)
it_it: Didascalia (facoltativa)

source: Supports basic HTML formatting.
es_es: Admite formato HTML básico.
fr_fr: Prend en charge le HTML de base.
it_it: Supporta la formattazione HTML di base.

source: Load / Refresh Preview
es_es: Cargar / actualizar vista previa
fr_fr: Charger / Actualiser l’aperçu
it_it: Carica / aggiorna anteprima

source: Use Current View for Initial State
es_es: Usar la vista actual como estado inicial
fr_fr: Utiliser la vue actuelle comme état initial
it_it: Usa la vista attuale come stato iniziale

source: Help content is not available. Run the "Render Help" build step to regenerate it.
es_es: El contenido de ayuda no está disponible. Ejecuta el paso de compilación "Render Help" para regenerarlo.
fr_fr: Le contenu d’aide est indisponible. Exécutez l’étape de build « Render Help » pour le régénérer.
it_it: Il contenuto della guida non è disponibile. Esegui il passaggio di build "Render Help" per rigenerarlo.

source: Zoom In
es_es: Acercar
fr_fr: Zoom avant
it_it: Zoom avanti

source: Zoom In (Ctrl +)
es_es: Acercar (Ctrl +)
fr_fr: Zoom avant (Ctrl +)
it_it: Zoom avanti (Ctrl +)

source: Zoom Out
es_es: Alejar
fr_fr: Zoom arrière
it_it: Zoom indietro

source: Zoom Out (Ctrl -)
es_es: Alejar (Ctrl -)
fr_fr: Zoom arrière (Ctrl -)
it_it: Zoom indietro (Ctrl -)

source: Reset Zoom
es_es: Restablecer zoom
fr_fr: Réinitialiser le zoom
it_it: Reimposta zoom

source: Center View
es_es: Centrar vista
fr_fr: Centrer la vue
it_it: Centra vista

source: Copy Center
es_es: Copiar centro
fr_fr: Copier le centre
it_it: Copia centro

source: Copy current center coordinates
es_es: Copiar las coordenadas del centro actual
fr_fr: Copier les coordonnées du centre actuel
it_it: Copia le coordinate del centro attuale

source: Error: SVG source not specified. Use [btsvviewer src="path/to/file.svg"]
fr_fr: Erreur : source SVG non spécifiée. Utilisez [btsvviewer src="path/to/file.svg"]
